[Killed] BlockStatement
main/components/HelpRequest/HelpRequestForm.js:34:40
 
   return (
     <Form
-      onSubmit={handleSubmit((data) => {
-        const modifiedData = {
-          ...data,
-          solved: data.solved === "true",
-        };
-        submitAction(modifiedData);
-      })}
+      onSubmit={handleSubmit((data) => {})}
     >
       <Row>
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:35:30
   return (
     <Form
       onSubmit={handleSubmit((data) => {
-        const modifiedData = {
-          ...data,
-          solved: data.solved === "true",
-        };
+        const modifiedData = {};
         submitAction(modifiedData);
       })}
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "id": 16,
+   "id": undefined,

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:37:19
       onSubmit={handleSubmit((data) => {
         const modifiedData = {
           ...data,
-          solved: data.solved === "true",
+          solved: false,
         };
         submitAction(modifiedData);
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"solved": true}
Received: {"explanation": "explanation", "requestTime": "2022-01-02T12:00", "requesterEmail": "ryanzanone@ucsb.edu", "solved": false, "tableOrBreakoutRoom": "true", "teamId": "5"}

Number of calls: 1

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:37:19
       onSubmit={handleSubmit((data) => {
         const modifiedData = {
           ...data,
-          solved: data.solved === "true",
+          solved: true,
         };
         submitAction(modifiedData);
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"ryanmz2104@gmail.com\",\"teamId\":\"6\",\"requestTime\":\"2024-02-02T00:00\",\"tableOrBreakoutRoom\":\"6\",\"explanation\":\"explanation\",\"solved\":false}"
Received: "{\"requesterEmail\":\"ryanmz2104@gmail.com\",\"teamId\":\"6\",\"requestTime\":\"2024-02-02T00:00\",\"tableOrBreakoutRoom\":\"6\",\"expla

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:73:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "Requester Email is required. "}
+              {true}
               {errors.requesterEmail?.type === "pattern" &&
                 "Please enter a valid email address. "}
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:74:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Please enter a valid email address. "}
+              {errors.requesterEmail?.type === "pattern" || "Please enter a valid email address. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Please enter a valid email address. </div> instead

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:75:17
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required. "}
               {errors.requesterEmail?.type === "pattern" &&
-                "Please enter a valid email address. "}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /Please enter a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:110:43
               id="explanation"
               type="text"
               isInvalid={Boolean(errors.explanation)}
-              {...register("explanation", {
-                required: true,
-              })}
+              {...register("explanation", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:111:27
               type="text"
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
-                required: true,
+                required: false,
               })}
             />
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:135:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamId && "Team ID is required. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:135:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamId && "Team ID is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:155:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.tableOrBreakoutRoom &&
-                "Table or Breakout Room is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:155:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.tableOrBreakoutRoom &&
-                "Table or Breakout Room is required. "}
+              {errors.tableOrBreakoutRoom || "Table or Breakout Room is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:156:17
             />
             <Form.Control.Feedback type="invalid">
               {errors.tableOrBreakoutRoom &&
-                "Table or Breakout Room is required. "}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
