[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:58:5
       Header: "Explanation",
       accessor: "explanation",
     },
-    {
-      Header: "Solved",
-      id: "solved",
-      accessor: (helpRequest) =>
-        helpRequest.solved ? helpRequest.solved.toString() : "N/A",
-    },
+    {},
   ];
 
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:61:17
     {
       Header: "Solved",
       id: "solved",
-      accessor: (helpRequest) =>
-        helpRequest.solved ? helpRequest.solved.toString() : "N/A",
+      accessor: () => undefined,
     },
   ];
killedBy: HelpRequestTable tests displays 'N/A' for missing solved value
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  N/A
Received:

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:62:62
       Header: "Solved",
       id: "solved",
       accessor: (helpRequest) =>
-        helpRequest.solved ? helpRequest.solved.toString() : "N/A",
+        helpRequest.solved ? helpRequest.solved.toString() : "",
     },
   ];
killedBy: HelpRequestTable tests displays 'N/A' for missing solved value
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  N/A
Received:
