[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      requestTime: helpRequest.requestTime,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      requestTime: helpRequest.requestTime,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `New HelpRequest Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New HelpRequest Created - id: 16 email: ryanzanone@ucsb.edu"
Received: ""

Number of calls: 1
