[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/helprequest",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      requestTime: helpRequest.requestTime,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "HelpRequest Updated - id: 16 email: ryanmz2104@gmail.com"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
