[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:37:19
       onSubmit={handleSubmit((data) => {
         const modifiedData = {
           ...data,
-          solved: data.solved === "true",
+          solved: data.solved !== "true",
         };
         submitAction(modifiedData);
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"requesterEmail\":\"ryanmz2104@gmail.com\",\"teamId\":\"6\",\"requestTime\":\"2024-02-02T00:00\",\"tableOrBreakoutRoom\":\"6\",\"explanation\":\"explanation\",\"solved\":true}"
Received: "{\"requesterEmail\":\"ryanmz2104@gmail.com\",\"teamId\":\"6\",\"requestTime\":\"2024-02-02T00:00\",\"tableOrBreakoutRoom\":\"6\",\"explan

[Survived] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:172:38
               type="radio"
               name="solved"
               isInvalid={Boolean(errors.solved)}
-              {...register("solved", {
-                required: true,
-              })}
+              {...register("solved", {})}
             />
             <Form.Check

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:189:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.solved && "Please select one of these. "}
+              {errors.solved || "Please select one of these. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Survived] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:189:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.solved && "Please select one of these. "}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
