[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:18:34
   testIdPrefix = "OrganizationTable",
 }) {
   const navigate = useNavigate();
-  const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.values.orgField}`);
-  };
+  const editCallback = (cell) => {};
   // Stryker disable all : hard to test for query caching
   const deleteMutation = useBackendMutation(
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/SKY"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:19:14
 }) {
   const navigate = useNavigate();
   const editCallback = (cell) => {
-    navigate(`/ucsborganizations/edit/${cell.row.values.orgField}`);
+    navigate(``);
   };
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganizations/edit/SKY"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style
