[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/ucsborganizations`,
-      params: {
-        orgField,
-      },
+      params: {},
     },
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgField"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (organization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgField: organization.orgField,
-    },
-    data: {
-      orgField: organization.orgField,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSB Organization Updated - orgField: OSLI orgTranslationShort: STUDENT L orgTranslation: OFFICE OF STUDENT L inactive: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:53
     },
   );
 
-  const objectToAxiosPutParams = (organization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgField: organization.orgField,
-    },
-    data: {
-      orgField: organization.orgField,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = (organization) => ({});
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "UCSB Organization Updated - orgField: OSLI orgTranslationShort: STUDENT L orgTranslation: OFFICE OF STUDENT L inactive: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
