[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:94:39
               id="station"
               type="text"
               isInvalid={Boolean(errors.station)}
-              {...register("station", {
-                required: "Station is required.",
-                maxLength: {
-                  value: 50,
-                  message: "Max length is 50",
-                },
-              })}
+              {...register("station", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on bad input 3
statusReason: Error: Unable to find an element with the text: Max length is 50. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.js:96:28
               isInvalid={Boolean(errors.station)}
               {...register("station", {
                 required: "Station is required.",
-                maxLength: {
-                  value: 50,
-                  message: "Max length is 50",
-                },
+                maxLength: {},
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messages on bad input 3
statusReason: Error: Unable to find an element with the text: Max length is 50. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
