[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:51:5
       Header: "Name",
       accessor: "name",
     },
-    {
-        Header: "Station",
-        accessor: "station",
-    }
+    {}
   ];
 
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: A column ID (or string accessor) is required!
