[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/diningcommonsmenuitem/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/diningcommonsmenuitem/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
