[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:133:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "Date must be in ISO format."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Date must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:133:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "Date must be in ISO format."}
+              {errors.dateAdded || "Date must be in ISO format."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
