[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:73:45
               id="reviewerEmail"
               type="email"
               isInvalid={Boolean(errors.reviewerEmail)}
-              {...register("reviewerEmail", {
-                required: "Reviewer Email is required.",
-                // pattern: {
-                //   //value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-                //   message: "Enter a valid email.",
-                // },
-              })}
+              {...register("reviewerEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests displays correct error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:97:37
               min="1"
               max="5"
               isInvalid={Boolean(errors.stars)}
-              {...register("stars", {
-                required: "Rating is required.",
-                // min: { value: 1, message: "Rating must be between 1 and 5." },
-                // max: { value: 5, message: "Rating must be between 1 and 5." },
-              })}
+              {...register("stars", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests displays correct error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Rating is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
